note/2020/emacs-theme-utility/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-12 Sat 16:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Theme Utility</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up-index-page">
<div>
<a accesskey="h" href="../../index.html"> UP </a> |
<a accesskey="H" href="../../../index.html"> HOME </a>
</div>
<div>
<a href="../rss.xml"> RSS </a> |
<a href="https://github.com/casouri/casouri.github.io"> Source </a> |
<a href="https://creativecommons.org/licenses/by-sa/4.0/"> License </a>
</div>
</div><div id="content">
<h1 class="title">Emacs Theme Utility</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Expand-face-attributes">Expand face attributes</a></li>
<li><a href="#Define-a-theme">Define a theme</a></li>
</ul>
</div>
</div>
<p>
Here is yet another theme utility for defining themes. I made the wrapper extremely thin and didn’t use any macros. And most of the lines of my theme definition can fit in 70 columns (which matters!).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(font-lock-builtin-face              (nil ,violet2))
(font-lock-comment-face              (nil ,fg-weak))
(font-lock-comment-delimiter-face    (font-lock-comment-face))
(font-lock-doc-face                  (font-lock-comment-face))
(font-lock-constant-face             (nil ,violet1))
(font-lock-function-name-face        (nil ,violet2))
(font-lock-keyword-face              (nil ,red))
(font-lock-string-face               (nil ,green))
(font-lock-type-face                 (nil ,yellow))
(font-lock-variable-name-face        (nil ,violet2))
(font-lock-warning-face              (warning))
...
</pre>
</div>

<div id="outline-container-orge168844" class="outline-2">
<h2 id="Expand-face-attributes">Expand face attributes</h2>
<div class="outline-text-2" id="text-Expand-face-attributes">
<p>
I want to save writing face attribute keywords over and over again. So I decide to use this form:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(face (inherit foreground background underline weight slant)
      other-attributes display)
</pre>
</div>

<p>
which determines common attributes by position. Other uncommon attributes are in <code>OTHER-ATTRIBUTES</code> as a plist. <code>DISPLAY</code> allows specifying some display attributes like terminal type or color. For example, 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(theme-util-make-face-spec
 '(default (nil <span style="color: #50a14f;">"white"</span> <span style="color: #50a14f;">"black"</span> t bold)
           (<span style="color: #a626a4;">:family</span> <span style="color: #50a14f;">"Charter"</span> <span style="color: #a626a4;">:height</span> 150)))
</pre>
</div>

<p>
returns
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(default ((t <span style="color: #a626a4;">:foreground</span> <span style="color: #50a14f;">"white"</span> <span style="color: #a626a4;">:background</span> <span style="color: #50a14f;">"black"</span> <span style="color: #a626a4;">:underline</span> t
             <span style="color: #a626a4;">:weight</span> bold <span style="color: #a626a4;">:family</span> <span style="color: #50a14f;">"Charter"</span> <span style="color: #a626a4;">:height</span> 150)))
</pre>
</div>

<p>
which is a valid face spec that you can feed to <code>custom-theme-set-faces</code>.
</p>

<p>
Let’s try another one with some <code>DISPLAY</code> constraints:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(theme-util-make-face-spec
 '(default (nil <span style="color: #50a14f;">"white"</span> <span style="color: #50a14f;">"black"</span> t bold)
           nil 
           ((type ns) (min-color 256))))
</pre>
</div>

<p>
returns
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(default ((((type ns) (min-color 256)) 
           <span style="color: #a626a4;">:foreground</span> <span style="color: #50a14f;">"white"</span> <span style="color: #a626a4;">:background</span> <span style="color: #50a14f;">"black"</span> 
           <span style="color: #a626a4;">:underline</span> t <span style="color: #a626a4;">:weight</span> bold)))
</pre>
</div>

<p>
The expand function is simple:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">theme-util-make-face-spec</span> (spec)
  (<span style="color: #e45649;">let*</span> ((face (nth 0 spec))
         (attr (nth 1 spec))
         (rest-attr (nth 2 spec))
         (display (nth 3 spec))
         (inherit (nth 0 attr))
         (fg (nth 1 attr))
         (bg (nth 2 attr))
         (underline (nth 3 attr))
         (weight (nth 4 attr))
         (slant (nth 5 attr)))
    `(,face ((,(<span style="color: #e45649;">or</span> display t)
              . ,(remove
                  nil
                  (append (<span style="color: #e45649;">if</span> inherit (list <span style="color: #a626a4;">:inherit</span> inherit))
                          (<span style="color: #e45649;">if</span> fg (list <span style="color: #a626a4;">:foreground</span> fg))
                          (<span style="color: #e45649;">if</span> bg (list <span style="color: #a626a4;">:background</span> bg))
                          (<span style="color: #e45649;">if</span> underline (list <span style="color: #a626a4;">:underline</span> underline))
                          (<span style="color: #e45649;">if</span> weight (list <span style="color: #a626a4;">:weight</span> weight))
                          (<span style="color: #e45649;">if</span> slant (list <span style="color: #a626a4;">:slant</span> slant))
                          rest-attr)))))))
</pre>
</div>

<p>
I could even use <code>pcase-let</code> to pattern match the form, but <code>nth</code> is good enough.
</p>
</div>
</div>

<div id="outline-container-orgc40a52f" class="outline-2">
<h2 id="Define-a-theme">Define a theme</h2>
<div class="outline-text-2" id="text-Define-a-theme">
<p>
To define the theme, we just transform each face spec and pipe them to <code>custom-theme-set-faces</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">theme-util-set-faces</span> (name spec)
  (apply #'custom-theme-set-faces
         name
         (mapcar #'theme-util-make-face-spec
                 spec)))
</pre>
</div>

<p>
In action, it looks like this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(theme-util-set-faces 'light
  (<span style="color: #e45649;">cl-flet</span> ((darken #'theme-util-darken)
            (brighten #'theme-util-brighten)
            (overlay #'theme-util-color-overlay))
    (<span style="color: #e45649;">let*</span> ((bg        <span style="color: #50a14f;">"#fafafa"</span>)
           (bg-alt    (darken bg 0.05))
           (fg        <span style="color: #50a14f;">"#2b3239"</span>)
           (fg-weak   <span style="color: #50a14f;">"#9a9ea2"</span>)
           (blue1     <span style="color: #50a14f;">"#a0bcf8"</span>)
           (blue2     <span style="color: #50a14f;">"#4078f2"</span>)
           (green     <span style="color: #50a14f;">"#50a14f"</span>)
           (orange    <span style="color: #50a14f;">"#da8548"</span>)
           (red       <span style="color: #50a14f;">"#e45649"</span>)
           (yellow    <span style="color: #50a14f;">"#986801"</span>)
           (violet1   <span style="color: #50a14f;">"#b751b6"</span>)
           (violet2   <span style="color: #50a14f;">"#a626a4"</span>)
           <span style="color: #9a9ea2;">;; </span><span style="color: #9a9ea2;">Note that this is not a cons cell.</span>
           (tty       '((type nil))))
      `(<span style="color: #9a9ea2;">;; </span><span style="color: #9a9ea2;">builtin faces</span>
        (default     (nil ,fg ,bg))
        (region      (nil nil ,(overlay bg violet1 0.1)))
        (highlight   (nil <span style="color: #50a14f;">"white"</span> ,blue2))
        (cursor      (nil <span style="color: #50a14f;">"white"</span> <span style="color: #50a14f;">"black"</span>))
        (link        (nil ,blue2 nil nil))
        (match       (nil ,green nil nil bold))

        ...

        (font-lock-builtin-face              (nil ,violet2))
        (font-lock-comment-face              (nil ,fg-weak))
        (font-lock-comment-delimiter-face    (font-lock-comment-face))
        (font-lock-doc-face                  (font-lock-comment-face))
        (font-lock-constant-face             (nil ,violet1))
        (widget-inactive (default))))))
</pre>
</div>

<p>
Note that I used local functions and variables rather than defining macros. It’s tempting to use macros when you can, but many times you don’t really need it, and using macros in fact makes stuff more complicated (look at doom-themes.el).
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Written by Yuan Fu</p>
<p class="first-publish">First Published on 2020-09-12 Sat 15:09</p>
<p class-"last-modified">Last modified on 2020-09-12 Sat 16:03</p>
<p>Send your comment to 
<a href="mailto:archive.casouri.cat@gmail.com">
archive.casouri.cat@gmail.com</a></p>
</div>
</body>
</html>
